InformationRegisters/АК_ПаролиКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>АК_ПаролиКонтрагентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПервыйЗапуск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/ФормаАвторизацииКонтрагента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПарольОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Элемент.РежимПароля = НЕ Элемент.РежимПароля;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	//Закрыть(Ложь);
	ЗавершитьРаботуСистемы(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
Перем ЗаголовокПриложения;
	
	Если Не ЗначениеЗаполнено(ИНН) Тогда
	    Сообщить("Введите ИНН");
		Возврат;
	КонецЕсли;
	
	ЗаголовокПриложения = "";
	Если ПарольВведёнПравильно(ЗаголовокПриложения) Тогда
		
		Если НЕ Пустаястрока(ЗаголовокПриложения) Тогда
			УстановитьЗаголовокПриложения(ЗаголовокПриложения);
		КонецЕсли;

		Закрыть(Истина);
	Иначе
		Сообщить("Неправильный пароль!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПарольВведёнПравильно(ЗаголовокПриложения = "")
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	АК_ПаролиКонтрагентов.Контрагент
		|ИЗ
		|	РегистрСведений.АК_ПаролиКонтрагентов КАК АК_ПаролиКонтрагентов
		|ГДЕ
		|	АК_ПаролиКонтрагентов.Контрагент.ИНН = &ИНН
		|	И АК_ПаролиКонтрагентов.Пароль = &Пароль");
	Запрос.УстановитьПараметр("ИНН", ИНН);
	Запрос.УстановитьПараметр("Пароль", Пароль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда Возврат Ложь; КонецЕсли;
	
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	ВыборкаЗапроса.Следующий();
	ПараметрыСеанса.ТекущийКонтрагент = ВыборкаЗапроса.Контрагент;
	ПараметрыСеанса.НеСохранятьВерсииОбъектов = Истина;
	
	ЗаголовокПриложения = Константы.ЗаголовокСистемы.Получить() + " / " + СокрЛП(ПараметрыСеанса.ТекущийКонтрагент) + " / " + ИНН;
	
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Истина;
	
КонецФункции
